<script>
	import Accordion from '$lib/component/accordion.svelte';
	import Glow from '$lib/component/glow.svelte';
</script>

<section class="faq">
	<header class="header">
		<h2 class="title">سوالات متدوال</h2>
		<span class="subtitle">دوست داری دربارهٔ ما بیشتر بدونی؟</span>
		<span class="subtitle">شاید جواب سوالت رو اینجا پیدا کنی...</span>
		<span class="question-mark">?</span>
	</header>
	<div class="accordions">
		<Glow class="container-glow" />
		<Accordion title="چرا باید اکسس شاپ رو انتخاب کنی؟" open>
			با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقت و
			با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اما کار ما
			با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله از کار
			همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارت
			هستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبان
			حرفه‌ای هم می‌شه تکیه کرد.
		</Accordion>
		<Accordion title="فعال‌سازی اشتراک‌ها چقدر زمان می‌بره؟">
			با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقت و
			با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اما کار ما
			با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله از کار
			همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارت
			هستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبان
			حرفه‌ای هم می‌شه تکیه کرد.
		</Accordion>
		<Accordion title="آیا اشتراک‌ها قانونی هستند؟">
			با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقت و
			با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اما کار ما
			با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله از کار
			همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارت
			هستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبان
			حرفه‌ای هم می‌شه تکیه کرد.
		</Accordion>
		<Accordion title="آیا اشتراک‌ها قابل تمدید هستند؟">
			با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقت و
			با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اما کار ما
			با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله از کار
			همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارت
			هستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبان
			حرفه‌ای هم می‌شه تکیه کرد.
		</Accordion>
	</div>
</section>

<style>
	.faq {
		display: flex;
		align-items: center;
		gap: 9.6rem;
		margin-bottom: 19.2rem;
	}

	header {
		display: flex;
		flex-direction: column;
		gap: 0.8rem;
	}

	.accordions {
		position: relative;
		flex: 1;
		display: flex;
		flex-direction: column;
		gap: 1.6rem;
	}

	.accordions :global(.container-glow) {
		position: absolute;
		left: 50%;
		top: 50%;
		transform: translate(-50%, -50%);
		width: 76.8rem;
		z-index: -1;
	}

	.title {
		font-size: 3.6rem;
		font-weight: 800;
		margin-bottom: 1.2rem;
	}

	.subtitle {
		font-size: 2rem;
	}

	.question-mark {
		/* display: block; */
		text-align: center;
		font-size: 12.8rem;
		margin-top: 2.4rem;
	}
</style>
