type FAQ = {
	question: string;
	answer: string;
};

const faqList: FAQ[] = [
	{
		question: 'چرا باید اکسس شاپ رو انتخاب کنی؟',
		answer:
			'با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقتو با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اماکار ما با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله ازکار همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارتهستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبانحرفه‌ای هم می‌شه تکیه کرد.'
	},
	{
		question: 'فعال‌سازی اشتراک‌ها چقدر زمان می‌بره؟',
		answer:
			'با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقتو با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اماکار ما با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله ازکار همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارتهستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبانحرفه‌ای هم می‌شه تکیه کرد.'
	},
	{
		question: 'آیا اشتراک‌ها قانونی هستند؟',
		answer:
			'با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقتو با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اماکار ما با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله ازکار همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارتهستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبانحرفه‌ای هم می‌شه تکیه کرد.'
	},
	{
		question: 'آیا اشتراک‌ها قابل تمدید هستند؟',
		answer:
			'با اکسس شاپ می‌تونی به مجموعه‌ای گسترده از مدل‌های زبانی پیشرفته دسترسی داشته باشی که با دقتو با استفاده از آخرین فناوری‌ها آموزش دیده‌ن تا بهترین نتایج را برات به ارمغان بیارن. اماکار ما با ایجاد دسترسی تموم نمی‌شه. تیم پشتیبانی متخصص ما همیشه آماده‌ست تا در هر مرحله ازکار همراهیت کنه. از انتخاب مدل مناسب تا رفع مشکلات فنی و ارائه مشاوره‌های تخصصی، ما در کنارتهستیم. با انتخاب ما، نه تنها به ابزارهای قدرتمند دسترسی پیدا می‌کنی، بلکه به یک تیم پشتیبانحرفه‌ای هم می‌شه تکیه کرد.'
	}
];

export default faqList;
